CREATE TABLE side_menu_items (
	side_menu_item_id	INTEGER NOT NULL,
	side_menu_item_name	VARCHAR(100) NOT NULL,
	side_menu_item_parent_id	INTEGER NOT NULL,
	page_href_id	INTEGER NULL,
	PRIMARY KEY(side_menu_item_id AUTOINCREMENT)
);

INSERT INTO side_menu_items (side_menu_item_id, side_menu_item_name, side_menu_item_parent_id, page_href_id) 
VALUES 
(1, 'Аналитика и статистика', 0, NULL),
(2, 'Коммерческая аналитика', 1, 2),
(3, 'Производственная аналитика', 1, 3),
(4, 'Документация и записи', 0, NULL),
(5, 'Получить код документа', 4, 4),
(6, 'Зарегистрировать новый документ', 4, 5),
(7, 'Обновить версию документа', 4, 6),
(8, 'Изменить статус документа', 4, 7),
(9, 'Персонал', 0, NULL),
(10, 'Запросить справку в бухгалтерии', 9, 8),
(11, 'Подать ППУ', 9, 9),
(12, 'Сообщить о проблеме', 9, 10),
(13, 'Процессное управление', 0, NULL),
(14, 'Декомпозиция процессов', 13, 11),
(15, 'Управление качеством', 0, NULL),
(16, 'Замеры влажности', 15, 12),
(17, 'Замеры пылимости', 15, 13),
(18, 'Рекламации от покупателей', 15, 14),
(19, 'Целеполагание', 0, NULL),
(20, 'Внести показатели', 19, 15),
(21, 'Декомпозиция целей', 19, NULL),
(22, 'Основной заголовок', 0, 16),
(23, 'Заголовок 3 уровня', 21, 17)